brew "asdf"
brew "bat"
brew "bottom"
brew "chafa"
brew "cloudflared"
brew "diffutils"
brew "docker"
brew "dua-cli"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "git-who"
brew "git"
brew "gpg"
brew "imagemagick"
brew "jq"
brew "less"
brew "lf"
brew "litecli"
brew "mycli"
brew "ollama"
brew "ouch"
brew "pandoc"
brew "pastel"
brew "pgcli"
brew "poppler"
brew "ripgrep"

if OS.mac?
  cask "font-jetbrains-mono"
  cask "font-symbols-only-nerd-font"
  cask "hammerspoon"
  cask "wezterm"

  # Dependencies for asdf Erlang (https://github.com/asdf-vm/asdf-erlang)
  brew "autoconf"
  brew "openssl"
  brew "wxwidgets"

  # Dependencies for asdf Postgres (https://github.com/smashedtoatoms/asdf-postgres)
  brew "curl"
  brew "gcc"
  brew "icu4c"
  brew "ossp-uuid"
  brew "pkg-config"
  brew "readline"
  brew "zlib"
end

{{read_local Brewfile}}
